-- Дано количество секунд (целое положительное число), 
-- с помощью SQL, используя стандартные функции Oracle,
-- необходимо данное число представить в формате
-- часы:минуты:секунды (hh:mi:ss), например:
-- 95    = 00:01:35
-- 601   = 00:10:01 
-- 3672  = 01:01:12 
-- 9015  = 02:30:15
-- 94510 = 26:15:10
select '&SEC' as sec,
       lpad(floor('&SEC' / 3600), 2, 0) || ':' ||
       lpad(floor(mod('&SEC', 3600) / 60), 2, 0) || ':' ||
       lpad(mod('&SEC', 60), 2, 0) as "HH:MI:SS"
  from dual;
